vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpi2c_cmsis.c
AT_NONCACHEABLE_SECTION(static lpi2c_master_edma_handle_t LPI2C15_EdmaHandle);
static edma_handle_t LPI2C15_EdmaTxHandle;
static edma_handle_t LPI2C15_EdmaRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpi2c15_edma_driver_state")
static cmsis_lpi2c_edma_driver_state_t LPI2C15_EdmaDriverState = {
#else
static cmsis_lpi2c_edma_driver_state_t LPI2C15_EdmaDriverState = {
#endif
    &LPI2C15_Resource, &LPI2C15_EdmaResource, &LPI2C15_EdmaHandle, &LPI2C15_EdmaTxHandle, &LPI2C15_EdmaRxHandle,
};

static int32_t LPI2C15_Master_EdmaInitialize(ARM_I2C_SignalEvent_t cb_event)
{
#ifdef RTE_I2C15_PIN_INIT
    RTE_I2C15_PIN_INIT();
#endif
    return LPI2C_Master_EdmaInitialize(cb_event, &LPI2C15_EdmaDriverState);
}

static int32_t LPI2C15_Master_EdmaUninitialize(void)
{
#ifdef RTE_I2C15_PIN_DEINIT
    RTE_I2C15_PIN_DEINIT();
#endif
    return LPI2C_Master_EdmaUninitialize(&LPI2C15_EdmaDriverState);
}

static int32_t LPI2C15_Master_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPI2C_Master_EdmaPowerControl(state, &LPI2C15_EdmaDriverState);
}

static int32_t LPI2C15_Master_EdmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_EdmaTransmit(addr, data, num, xfer_pending, &LPI2C15_EdmaDriverState);
}

static int32_t LPI2C15_Master_EdmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_EdmaReceive(addr, data, num, xfer_pending, &LPI2C15_EdmaDriverState);
}

static int32_t LPI2C15_Master_EdmaGetDataCount(void)
{
    return LPI2C_Master_EdmaGetDataCount(&LPI2C15_EdmaDriverState);
}

static int32_t LPI2C15_Master_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPI2C_Master_EdmaControl(control, arg, &LPI2C15_EdmaDriverState);
}

static ARM_I2C_STATUS LPI2C15_Master_EdmaGetStatus(void)
{
    return LPI2C_Master_EdmaGetStatus(&LPI2C15_EdmaDriverState);
}

#endif

#else

static cmsis_i2c_handle_t LPI2C15_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpi2c15_interrupt_driver_state")
static cmsis_lpi2c_interrupt_driver_state_t LPI2C15_InterruptDriverState = {
#else
static cmsis_lpi2c_interrupt_driver_state_t LPI2C15_InterruptDriverState = {
#endif
    &LPI2C15_Resource,
    &LPI2C15_Handle,
};

static void KSDK_LPI2C15_SLAVE_InterruptCallback(LPI2C_Type *base, lpi2c_slave_transfer_t *xfer, void *userData)
{
    KSDK_LPI2C_SLAVE_InterruptCallback(base, xfer, userData, &LPI2C15_InterruptDriverState);
}

static int32_t LPI2C15_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event)
{
#ifdef RTE_I2C15_PIN_INIT
    RTE_I2C15_PIN_INIT();
#endif
    return LPI2C_InterruptInitialize(cb_event, &LPI2C15_InterruptDriverState);
}

static int32_t LPI2C15_InterruptUninitialize(void)
{
#ifdef RTE_I2C15_PIN_DEINIT
    RTE_I2C15_PIN_DEINIT();
#endif
    return LPI2C_InterruptUninitialize(&LPI2C15_InterruptDriverState);
}

static int32_t LPI2C15_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPI2C_InterruptPowerControl(state, &LPI2C15_InterruptDriverState);
}

static int32_t LPI2C15_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &LPI2C15_InterruptDriverState);
}

static int32_t LPI2C15_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return LPI2C_Master_InterruptReceive(addr, data, num, xfer_pending, &LPI2C15_InterruptDriverState);
}

static int32_t LPI2C15_Slave_InterruptTransmit(const uint8_t *data, uint32_t num)
{
    LPI2C15_InterruptDriverState.handle->slave_handle.callback = KSDK_LPI2C15_SLAVE_InterruptCallback;
    return LPI2C_Slave_InterruptTransmit(data, num, &LPI2C15_InterruptDriverState);
}

static int32_t LPI2C15_Slave_InterruptReceive(uint8_t *data, uint32_t num)
{
    LPI2C15_InterruptDriverState.handle->slave_handle.callback = KSDK_LPI2C15_SLAVE_InterruptCallback;
    return LPI2C_Slave_InterruptReceive(data, num, &LPI2C15_InterruptDriverState);
}

static int32_t LPI2C15_InterruptGetDataCount(void)
{
    return LPI2C_InterruptGetDataCount(&LPI2C15_InterruptDriverState);
}

static int32_t LPI2C15_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPI2C_InterruptControl(control, arg, &LPI2C15_InterruptDriverState);
}

static ARM_I2C_STATUS LPI2C15_InterruptGetStatus(void)
{
    return LPI2C_InterruptGetStatus(&LPI2C15_InterruptDriverState);
}

#endif /* RTE_I2C15_DMA_EN */

ARM_DRIVER_I2C Driver_I2C15 = {LPI2Cx_GetVersion,
                               LPI2Cx_GetCapabilities,
#if defined(RTE_I2C15_DMA_EN) && RTE_I2C15_DMA_EN
                               LPI2C15_Master_EdmaInitialize,
                               LPI2C15_Master_EdmaUninitialize,
                               LPI2C15_Master_EdmaPowerControl,
                               LPI2C15_Master_EdmaTransmit,
                               LPI2C15_Master_EdmaReceive,
                               NULL,
                               NULL,
                               LPI2C15_Master_EdmaGetDataCount,
                               LPI2C15_Master_EdmaControl,
                               LPI2C15_Master_EdmaGetStatus
#else
                               LPI2C15_InterruptInitialize,
                               LPI2C15_InterruptUninitialize,
                               LPI2C15_InterruptPowerControl,
                               LPI2C15_Master_InterruptTransmit,
                               LPI2C15_Master_InterruptReceive,
                               LPI2C15_Slave_InterruptTransmit,
                               LPI2C15_Slave_InterruptReceive,
                               LPI2C15_InterruptGetDataCount,
                               LPI2C15_InterruptControl,
                               LPI2C15_InterruptGetStatus
#endif /* RTE_I2C15_DMA_EN */
};

#endif /* LPI2C15 */

#if (defined(LPI2C16) || defined(LPI2C_16)) && defined(RTE_I2C16) && RTE_I2C16
/* User needs to provide the implementation for LPI2C16_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPI2C16_GetFreq(void);

